const Mock = require("mockjs");
const M = Mock.Random;
module.exports = {
    //###################################
    //手机端---成绩查询
    //###################################
    //自我测评
    gradeFilter2: Mock.mock({
        "data|4-6": [
            {
                "id|+1": 1,
                "name|+1": [
                    "高一上学期",
                    "高一下学期",
                    "高二上学期",
                    "高二下学期",
                    "高三上学期",
                    "高三下学期"
                ],
                "kaoshi|2": [
                    {
                        "id|+1": 1,
                        "gid|+1": 1,
                        "name|+1": [
                            "期中考试",
                            "期末考试",
                            "期中考试2",
                            "期末考试3"
                        ]
                    }
                ]
            }
        ]
    }),
    gradeFilter: Mock.mock({
        "data|4-6": [
            {
                "grade_id|+1": 1,
                grade_name: function() {
                    return "高一" + this.grade_id;
                },
                "semester_data|3": [
                    {
                        semester: "2017-02",
                        semester_name: function() {
                            return "上学期";
                        },
                        "exam_data|2": [
                            {
                                exam_type: "01",
                                exam_name: function() {
                                    return "考试" + this.grade_id;
                                },
                                'upload_id|+1': 327,
                                "grade_id|+1": 1
                            }
                        ]
                    }
                ]
            }
        ]
    }),

    testsQuery: Mock.mock({
        "mydata|5": [
            {
                "id|+1": 1,
                "name|+1": ["语文1", "语文2", "语文3", "语文4", "语文5"],
                "fen|+1": [100, 120, 110, 124, 134],
            }
        ],
        "classdata|5": [
            {
                "id|+1": 1,
                "name|+1": ["语文11", "语文22", "语文33", "语文44", "语文55"],
                "fen|+1": [113, 114, 121, 131, 127]
            }
        ],
        "gradedata|5": [
            {
                "id|+1": 1,
                "name|+1": [
                    "语文111",
                    "语文222",
                    "语文333",
                    "语文444",
                    "语文555"
                ],
                "fen|+1": [123, 114, 121, 131, 127]
            }
        ],
        "zongfen":[
            ["语数外总分", 423, 434, 345],
            ["优势科目", "语文", "", ""],
            ["劣势科目", "数学", "", ""]
        ]
    }),

    testsFollowGrade: Mock.mock({
        "data|3": [
            {
                "id|+1": 1,
                "name|+1": ["高一", "高二", "高三"],
                "kaoshi|2": [
                    {
                        "id|+1": 1,
                        "gid|+1": 1,
                        "name|+1": [
                            "期中考试",
                            "期末考试",
                            "期中考试2",
                            "期末考试3"
                        ]
                    }
                ]
            }
        ]
    }),
    testsFollowTests: Mock.mock({
        "data|3": [
            {
                "id|+1": 1,
                "name|+1": ["期中考试", "期末考试"],
                kemu: [
                    {
                        "id|+1": 11,
                        "name|+1": ["语文"],
                        "fen|1": ["110", "130"],
                        "dengji|1": ["A", "B"],
                        "grade|1": ["高一"],
                        "pm|1": ["23", "24", "35"]
                    },
                    {
                        "id|+1": 12,
                        "name|+1": ["数学"],
                        "fen|1": ["110", "130"],
                        "dengji|1": ["A", "B"],
                        "grade|1": ["高一"],
                        "pm|1": ["23", "24", "35"]
                    },
                    {
                        "id|+1": 13,
                        "name|+1": ["外语"],
                        "fen|1": ["110", "130"],
                        "dengji|1": ["A", "B"],
                        "grade|1": ["高一"],
                        "pm|1": ["23", "24", "35"]
                    },
                    {
                        "id|+1": 14,
                        "name|+1": ["化学"],
                        "fen|1": ["110", "130"],
                        "dengji|1": ["A", "B"],
                        "grade|1": ["高一"],
                        "pm|1": ["23", "24", "35"]
                    }
                ]
            }
        ]
    })
};
